# Function Application and Mapping

# create function in python
def name():
    body

In [4]:
def mul(a,b):
    print('the result is:')
    return a*b

In [5]:
mul(5,4)

the result is:

20

In [6]:
def doc():
    print('hello word')

In [8]:
doc()

hello word

In [10]:
import pandas as pd
import numpy as np

In [11]:
frame = pd.DataFrame(np.random.rand(4,3),columns = list('bde'),index=['Uthas','ohio','texas','coladro'])

In [14]:
frame

                b         d         e
Uthas    0.355546  0.438604  0.913653
ohio     0.337117  0.081256  0.294465
texas    0.359020  0.865881  0.185871
coladro  0.457262  0.169246  0.739925

In [17]:
np.abs(frame)

                b         d         e
Uthas    0.355546  0.438604  0.913653
ohio     0.337117  0.081256  0.294465
texas    0.359020  0.865881  0.185871
coladro  0.457262  0.169246  0.739925

In [18]:
frame.b=-0.18

In [19]:
frame

            b         d         e
Uthas   -0.18  0.438604  0.913653
ohio    -0.18  0.081256  0.294465
texas   -0.18  0.865881  0.185871
coladro -0.18  0.169246  0.739925

In [20]:
np.abs(frame)

            b         d         e
Uthas    0.18  0.438604  0.913653
ohio     0.18  0.081256  0.294465
texas    0.18  0.865881  0.185871
coladro  0.18  0.169246  0.739925

In [21]:
f = lambda x :x.max() - x.min()

In [22]:
frame.apply(f)

b    0.000000
d    0.784625
e    0.727782
dtype: float64

In [23]:
0.86 - 0.08

0.78

In [24]:
f1 = lambda x: x*2

In [27]:
%timeit
frame.apply(f1)

            b         d         e
Uthas   -0.36  0.877208  1.827306
ohio    -0.36  0.162513  0.588931
texas   -0.36  1.731763  0.371741
coladro -0.36  0.338491  1.479850

In [29]:
frame.apply(f1,axis=0)

            b         d         e
Uthas   -0.36  0.877208  1.827306
ohio    -0.36  0.162513  0.588931
texas   -0.36  1.731763  0.371741
coladro -0.36  0.338491  1.479850

In [31]:
frame.apply(f1,axis='rows')

            b         d         e
Uthas   -0.36  0.877208  1.827306
ohio    -0.36  0.162513  0.588931
texas   -0.36  1.731763  0.371741
coladro -0.36  0.338491  1.479850

In [32]:
frame.apply(f,axis='columns')

Uthas      1.093653
ohio       0.474465
texas      1.045881
coladro    0.919925
dtype: float64

In [33]:
frame.apply(f,axis='rows')

b    0.000000
d    0.784625
e    0.727782
dtype: float64

In [34]:
frame

            b         d         e
Uthas   -0.18  0.438604  0.913653
ohio    -0.18  0.081256  0.294465
texas   -0.18  0.865881  0.185871
coladro -0.18  0.169246  0.739925

In [36]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [38]:
frame.apply(f,axis='columns')

          min       max
Uthas   -0.18  0.913653
ohio    -0.18  0.294465
texas   -0.18  0.865881
coladro -0.18  0.739925

In [39]:
frame.apply(f,axis='rows')

        b         d         e
min -0.18  0.081256  0.185871
max -0.18  0.865881  0.913653

In [42]:
formate = lambda x:'%.2f'% x

In [44]:
type(frame)

pandas.core.frame.DataFrame

In [47]:
frame['d']

Uthas      0.438604
ohio       0.081256
texas      0.865881
coladro    0.169246
Name: d, dtype: float64

In [48]:
frame['d'].apply(formate)

Uthas      0.44
ohio       0.08
texas      0.87
coladro    0.17
Name: d, dtype: object

In [51]:
round(frame,2)

            b     d     e
Uthas   -0.18  0.44  0.91
ohio    -0.18  0.08  0.29
texas   -0.18  0.87  0.19
coladro -0.18  0.17  0.74

In [55]:
frame.applymap(formate)

             b     d     e
Uthas    -0.18  0.44  0.91
ohio     -0.18  0.08  0.29
texas    -0.18  0.87  0.19
coladro  -0.18  0.17  0.74

In [56]:
frame['e'].map(formate)

Uthas      0.91
ohio       0.29
texas      0.19
coladro    0.74
Name: e, dtype: object